app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("nome", "sobrenome", "cpf", "email", "telefone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "sobrenome" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["sobrenome", "Cicolin Rocha"], ["updated_at", "2022-01-19 20:42:13.018616"], ["id", 3]]

  def destroy
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]